# ColumnsExcluded Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScheduleViewFailures..::..ColumnsExcluded Property
BuiltInFailures..::..ScheduleViewFailures Class See Also
---
Some columns in the project are excluded from the graphical column schedule view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnsExcluded { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnsExcluded As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnsExcluded {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ScheduleViewFailures Class
Autodesk.Revit.DB Namespace